<template>
<div>

    <header>
        <div class="navbar navbar-default">
            <div class="container">
                <div class="navbar-header">
                    <nuxt-link to="/" class="navbar-brand">Ayatori</nuxt-link>
                </div>
            </div>
        </div>
    </header>

    <section>
        <div class="container">
            <div class="page-header">
                <div class="row">
                    <div class="col-md-3 col-xs-12">
                        <div id="sidebar" class="list-group">
                            <a href="#one" class="list-group-item">
                                形態素解析について
                            </a>
                            <a href="#two" class="list-group-item">
                                文体の分析
                            </a>
                            <a href="#three" class="list-group-item">
                                特徴的な語彙の抽出
                            </a>
                        </div>
                    </div>
                    <div class="col-md-9 col-xs-12">
                        <div id="one">
                            <h3>形態素解析について</h3>
                            <p class="text-muted">
                                取得したすべての短歌をまとめて形態素解析にかけることで、短歌をテキスト分析しています。<wbr />
                                Ayatoriではkuromoji.js（IPAdic）を使って外部サーバで形態素解析をおこなっています。
                            </p>
                        </div>
                        <div id="two">
                            <h3>文体の分析</h3>
                            <p class="text-muted">
                                文体について分析する手がかりとして、名詞率・MVR・VNRの３つの値を算出しています。<wbr />
                                概観を把握しやすいようにレーダーチャートにして表示していますが、各値のあいだには必ずしも関係はありません。
                            </p>
                            <p class="text-muted">
                                名詞率は自立語の総数に対する名詞の割合です。一般に名詞率が高いと凝縮的・要約的な文体になるといわれています。
                            </p>
                            <p class="text-muted">
                                MVRは動詞の数に対する修飾語（形容詞・副詞・連体詞）の割合です。<wbr />
                                この値が小さい（動詞が多い）と動きのある物語的な文章になり、この値が大きい（修飾語が多い）と記述的・描写的な文章になるとされています。
                            </p>
                            <p class="text-muted">
                                VNRは名詞の数に対する動詞の割合です。この値が大きい（動詞が多い）と、よりダイナミックで事件展開型の文章になるといわれています。
                            </p>
                        </div>
                        <div id="three">
                            <h3>特徴的な語彙の抽出</h3>
                            <p class="text-muted">
                                分析対象の短歌のなかで相対的によく使われている単語を抽出しています。<wbr />
                                単語の「使用度」は、すべての短歌を形態素単位で分かち書きにしたうえで、短歌ごとにTfIdfで重みづけしつつ、各形態素の全体を通じての使用回数を集計したものです。
                            </p>
                            <p class="text-muted">
                                特徴的な語彙を抽出するうえで、ふつうに日本語を使っていて頻出すると考えられる以下の語彙と、ひらがなやカタカナ一文字へと分割された語彙は、ストップワードとして取り除いて集計しています。<wbr />
                                また、このような処理をおこなう場合、句読点などの記号類はあらかじめ取り除くことがありますが、短歌を分析するうえでは記号類の使用が短歌の特徴としてあらわれることがあるため、ここでは記号類に特別な処理はおこなっていません。
                            </p>
                            <h4>ストップワードの一覧</h4>
                            <pre><code>"あそこ","あたり","あちら","あっち","あと","あな","あなた","あれ","いくつ","いつ","いま","いや","いろいろ","うち","おおまか","おまえ","おれ","がい","かく","かたち","かやの","から","がら","きた","くせ","ここ","こっち","こと","ごと","こちら","ごっちゃ","これ","これら","ごろ","さまざま","さらい","さん","しかた","しよう","すか","ずつ","すね","すべて","ぜんぶ","そう","そこ","そちら","そっち","そで","それ","それぞれ","それなり","たくさん","たち","たび","ため","だめ","ちゃ","ちゃん","てん","とおり","とき","どこ","どこか","ところ","どちら","どっか","どっち","どれ","なか","なかば","なに","など","なん","はじめ","はず","はるか","ひと","ひとつ","ふく","ぶり","べつ","へん","ぺん","ほう","ほか","まさ","まし","まとも","まま","みたい","みつ","みなさん","みんな","もと","もの","もん","やつ","よう","よそ","わけ","わたし","","ハイ","","","上","中","下","字","","","年","月","日","時","分","秒","週","火","水","木","金","土","国","都","道","府","県","市","区","町","村","","","各","第","方","何","的","度","文","者","性","体","人","他","今","部","課","係","外","類","達","気","室","口","誰","用","界","会","首","男","女","別","話","私","屋","店","家","場","等","見","際","観","段","略","例","系","論","形","間","地","員","線","点","書","品","力","法","感","作","元","手","数","彼","彼女","子","内","楽","喜","怒","哀","輪","頃","化","境","俺","奴","高","校","婦","伸","紀","誌","レ","行","列","事","士","台","集","様","所","歴","器","名","情","連","毎","式","簿","","","","","回","匹","個","席","束","歳","目","通","面","円","玉","枚","","前","後","左","右","次","先","","春","夏","秋","冬","","","","一","二","三","四","五","六","七","八","九","十","百","千","万","億","兆","","","下記","上記","時間","今回","前回","場合","一つ","年生","自分","ヶ所","ヵ所","カ所","箇所","ヶ月","ヵ月","カ月","箇月","名前","本当","確か","時点","全部","関係","近く","方法","我々","違い","多く","扱い","新た","その後","半ば","結局","様々","以前","以後","以降","未満","以上","以下","幾つ","毎日","自体","向こう","何人","手段","同じ","感じ","ある","いる","くる","ない","する"</code></pre>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>

    <my-footer></my-footer>

</div>
</template>

<script>
import footer from "~/components/Footer.vue"

export default {
    components: {
        "my-footer": footer
    },
    mounted () {
        const cb = new ClipboardJS(".btn-link")
        cb.on("success", e => {
            console.info(e)
        })
    }
}
</script>
